{
  "status": "success",
  "totalResults": 326,
  "results": [
    {
      "title": "BJP, Cong trade barbs over Rahul#39;s Pegasus remarks at Cambridge University",
      "link": "https://www.moneycontrol.com/news/politics/bjp-cong-trade-barbs-over-rahul39s-pegasus-remarks-at-cambridge-university_16917131.html",
      "keywords": null,
      "creator": null,
      "video_url": null,
      "description": "Referring to the controversial Pegasus snooping issue, Gandhi alleged that the Israeli spyware was installed on the phones of a large number of politicians, including him.",
      "content": "Rahul Gandhi had said that the beard grew during the Bharat Jodo Yatra. (Image: @IYC/Twitter) Congress leader Rahul Gandhi's remarks at Cambridge University that he was under surveillance triggered a political slugfest on Friday with the BJP accusing him of maligning India on foreign soil and the Congress hitting back by citing instances of Prime Minister Narendra Modi raking up internal politics abroad. Gandhi, who is a visiting fellow of the Cambridge Judge Business School, during a lecture 'Learning to Listen in the 21st Century' on Tuesday evening said Indian democracy is under attack and several politicians, including himself, are under surveillance. Referring to the controversial Pegasus snooping issue, Gandhi alleged that the Israeli spyware was installed on the phones of a large number of politicians, including him. \"I, myself, had Pegasus on my phone. A large number of politicians have Pegasus on their phones. I've been called by intelligence officers who say please be careful what you say on the phone because we are sort of recording this stuff. So, this is a constant pressure that we feel,\" the 52-year-old former Congress chief claimed at the lecture, a video recording of which was posted on Twitter by Congress leader Sam Pitroda, ex-adviser to former prime minister Manmohan Singh. Reacting to the remarks, Union Minister Anurag Thakur hit out at Gandhi over his claims of being under surveillance by intelligence agencies and accused him of maligning India on foreign soil after facing successive electoral setbacks. \"Pegasus is not in Rahul Gandhi's phone but in his mind,\" he said. Related stories CDC report suggests child deaths in Gambia linked to consumption of made-in-India cough syrups Australian PM Anthony Albanese to visit India from March 8-11 Delhi LG orders transfers and postings of bureaucrats Thakur wondered what prevented Gandhi and other Congress leaders from submitting their phones to a Supreme Court-appointed technical committee that probed the Pegasus snooping issue. \"We can understand his hatred towards the prime minister, but the conspiracy to malign the country on foreign soil with the help of foreign friends raises questions on the agenda of the Congress,\" the information and broadcasting minister told reporters here. Thakur said Gandhi was aware of the electoral rout the Congress was facing in the assembly elections and had resorted to levelling allegations from foreign soil. \"Once again, the Congress lost in the elections but their bankruptcy was evident when they lost no opportunity to malign India from foreign soil,\" he said. Assam Chief Minister Himanta Biswa Sarma also hit out at Gandhi, calling his speech a \"brazen attempt to denigrate India\" on foreign soil in the \"guise of targeting\" the PM. In a series of tweets, the BJP leader took on the statements made by Rahul Gandhi and claimed that those were not based on facts. \"First foreign agents target us! Then our own targets us on a foreign land!\" Sarma wrote on the micro-blogging site. He maintained that Gandhi's speech at Cambridge was \"nothing but a brazen attempt to denigrate our country on foreign soil in the guise of targeting Adarniya PM Shri @narendramodi ji\". Taking on Gandhi's purported statement that \"Indian democracy is under threat because he can't freely express himself\", Sarma wrote: \"FACT: He travelled 4,000 km in his yatra incident-free under the protection provided by Modi Govt. Do we need to remind him how yatras led by BJP leaders were sabotaged when Cong was in power?\" Referring to Gandhi claiming that spyware Pegasus was found on his phone and an \"officer\" warned him regarding it, the CM maintained that the Congress MP refused to submit his phone for investigation when Supreme Court asked for it. \"Following extensive investigation, SC concluded that there was no evidence of Pegasus,\" he added. Stating that Gandhi has claimed that \"India's minorities are unsafe and treated like second class citizens\", Sarma wrote: \"FACT: Since May 2014, communal violence in India has been the lowest ever and prosperity of minority families the highest ever. Many minority leaders have reposed their faith in Modi Govt.\" Taking on Gandhi for his apparent praise of China as an aspiring superpower, citing Belt and Road initiative (BRI) as an example, Sarma retorted: \"FACT: BRI is solely responsible for the debt crisis facing several countries today.\" Claiming that Gandhi has admitted that he is fascinated by China and Communist party members have shaped his thoughts, Sarma said, \"Such rich praise for the Chinese is understandable. Gandhi family is trying to pay off its debts for the donations they took from them!\" The leader from the Northeast also took a swipe at Gandhi over his comments on Kashmir militants and Pulwama attack. \"Rahul says in Kashmir militants saw him, but he knew they wouldn't target him. Why was this not reported to security agencies? Was there some understanding Cong had with these militants to protect Rahul?\" Sarma questioned the Congress and its top leader. He maintained that Gandhi's description of the Pulwama attack as a \"car bomb that killed 40 soldiers\" was an insult to the jawans and questioned why he didn't name Pakistan as being behind the incident. \"How dare he insult our jawans? It wasn't a bomb sir, but a terror attack. No surprises that he refused to name Pakistan behind Pulwama attack. Is this part of the understanding Cong had with militants?\" Sarma wrote. Hitting back at Thakur and the BJP for its criticism of Gandhi, the Congress cited instances of Prime Minister Modi going abroad and allegedly raising internal politics and criticising the Congress. \"I have seen those foolish statements given by Anurag 'Golimaaro' Thakur,\" Congress spokesperson Supriya Shrinate said in an apparent reference to the 'Golimaro' slogans purportedly raised at a public meeting of Thakur last year. She urged the information and broadcasting minister him to listen to Gandhi's full lecture. On BJP's criticism that Gandhi was \"maligning\" the country from foreign soil, Shrinate said the kind of statements Modi had made abroad on internal politics and against the leading Opposition party of the country, if those are recounted then the BJP will have no place to hide. If they listen to Rahul Gandhi's lecture, they would get to know that he has talked about democracy and how the media, judiciary and the Opposition are intimidated and how it is important for agencies to remain impartial, she said. \"He (Gandhi) has talked about strengthening democracy. Those who give statements of 'Golimaaro' from stage and become cabinet minister from minister of state, they can never understand the meaning of these remarks,\" she said. Congress's head of media and publicity department Pawan Khera said the party would like to advise the BJP that they should stop such activities which are shameful to even discuss. \"So if they stop doing such activities, we will stop discussing them. There is an allegation on you (BJP) took the help of Israel to snoop into the phones of Opposition and your own leaders. They don't feel ashamed of that, but if it is discussed they feel shame,\" he said. The BJP thinks that England will not find out about their raid on BBC if the Congress does not discuss it, he said. \"We are living in a different era we are not living in the 17th or 18th century where news travelled at the speed of a camel cart or at the speed of a pigeon. Now if I am talking to you anybody sitting in Papua New Guinea can hear me out,\" Khera said. Earlier, the BJP made light of Rahul Gandhi's allegation that he was being snooped upon, saying the Congress leader was \"hallucinating\" and makes such claims as he wants to create headlines wherever he goes. \"What we can say for Rahul Gandhi's hallucinations. If he makes his (Congress) MoU with China public, we will be interested and people of India will also like to know. Who is interested in his telephonic conversations,\" BJP spokesperson Tom Vadakkan told reporters. Vadakkan noted that the Supreme Court has closed the Pegasus matter.",
      "pubDate": "2023-03-04 03:19:09",
      "image_url": null,
      "source_id": "moneycontrol",
      "category": ["top"],
      "country": ["india"],
      "language": "english"
    },
    {
      "title": "People have become low on tolerance, not willing to accept opinions: CJI Chandrachud",
      "link": "https://www.nationalheraldindia.com/india/people-have-become-low-on-tolerance-not-willing-to-accept-opinions-cji-chandrachud",
      "keywords": ["India"],
      "creator": null,
      "video_url": null,
      "description": "Chief Justice of India #DYChandrachud on Friday observed that a flip side of technology is that people have become \"low on tolerance\" and have retreated within, and that truth has become a victim of false news.",
      "content": "Chief Justice of India D.Y. Chandrachud on Friday observed that a flip side of technology is that people have become \"low on tolerance\" and have retreated within, and that truth has become a victim of false news. \"People are low on tolerance because they are not willing to accept your views. Humanity has also retreated within... Some of this is product of technology itself. Truth has become a victim of false news,\" he said after inaugurating the three-day international conference, being organised by the American Bar Association (ABA) on the theme \"Law in the Age of Glocalisation: Convergence of India and the West\". Solicitor General Tushar Mehta was also present. The CJI also expressed displeasure over how easily people troll judges when they do not agree with them. \"We did not have social media. We (judges) know that we are trolled by anyone who does not agree with us,\" he said, adding that when the Constitution of India was drafted, nobody knew how human society would evolve. The CJI also said that trolling comes when people are unwilling to accept opinion and perspective that are different from their own. \"Every little thing that we do - and believe me, as judges we are no exception to this - in everything that you do, you face the threat of being trolled by someone who doesn't share your point of view,\" he said. The CJI also dwelt on how something said as a seed germinates into a theory that cannot be tested on the anvil of rational science. He also highlighted how technology had been transforming our lives, especially the lives of judges. \"Covid gave us little option. The then CJI told me we have to close our doors and now how do we grant bail etc. I told the CJI we have desktop computers and we can start video conferencing,\" he noted. On appointing more women judges in the apex court and the high court, the CJI said he definitely supports it, but the answer is a \"little complex\". \"I am often asked about why we can't have more women judges in the Supreme Court than we have, why can't we have more high court judges from among the women we have. And the answer is not simple, the answer is a little complex. And I hope it has a gem of truth,\" he said. He pointed out that decentralisation of justice is the result of video conferencing and that it has become an important paradigm of access to justice. \"It has promoted equalisation of justice. Supreme Court is the supreme court of smallest of villages, and not just Tilak Marg of Delhi.\" Mehta said that the event of glocalisation could not have been held at a better venue than India. \"It is at the centre of glocalisation. India is now a destination as an economic powerhouse in the world,\" he remarked. \"We have made several statutory and legislative changes. We have reduced corporate tax. We have reduced conflict which clogged our justice system. Ease of doing business have become faster,\" he added. Follow us on: Facebook , Twitter , Google News , Instagram Join our official telegram channel ( @nationalherald ) and stay updated with the latest headlines",
      "pubDate": "2023-03-04 02:52:06",
      "image_url": "https://gumlet.assettype.com/nationalherald/2022-11/93e14b94-3fbf-4c91-8de4-c24244d061ab/chandrachud.jpeg",
      "source_id": "nationalheraldindia",
      "category": ["top"],
      "country": ["india"],
      "language": "english"
    },
    {
      "title": "Safety, Trust Can't Be Sacrificed At Altar Of Freedom Of Speech, Privacy: MoS Rajeev Chandrasekhar",
      "link": "https://zeenews.india.com/technology/safety-trust-cant-be-sacrificed-at-altar-of-freedom-of-speech-privacy-mos-rajeev-chandrasekhar-2579733.html",
      "keywords": null,
      "creator": null,
      "video_url": null,
      "description": "An intermediary wanting to do business in India is under obligation to carry out due diligence over the kind of content it carries, the minister said as he outlined the government's firm resolve in ensuring that platforms are accountable to users.",
      "content": "New Delhi: Minister of State for Electronics and IT Rajeev Chandrasekhar on Friday asserted that freedom of speech cannot be a cover for criminality, illegality and user harm, and emphasised that intermediaries have to be accountable for the content on their platforms. The minister was addressing the valedictory session of the National Conference on Child Sexual Abuse Material (CSAM) organised by the National Human Rights Commission in New Delhi. Chandrasekhar made it clear that safety and trust cannot be sacrificed at the altar of freedom of speech and privacy, according to an official release. \"For decades the model that was followed was that intermediaries were not accountable about the content on their platforms, and encouraged anonymity to prevent traceability of the illegal content. This helped the proliferation of child sexual abuse and other illegalities on the internet,\" Chandrasekhar said. An intermediary wanting to do business in India is under obligation to carry out due diligence over the kind of content it carries, the minister said as he outlined the government's firm resolve in ensuring that platforms are accountable to users. \"An intermediary, if it wants to do business in India, is now under obligation to carry out due diligence over the kind of content it carries and if there is content which is illegal or CSAM, it has to inform us about the first originator when a court order is produced,\" the minister said. He pointed out that the government and the intermediaries are not in any kind of adversarial relationship, and said it is in their joint interest to ensure that the internet is safe and trusted from exploitative material such as CSAM. The minister - while referring to CSAM content in the domain of online gaming - said, \"there are thousands of games which are gamified CSAM's ? we are in the process of enacting news rules under the IT Act which will make it very difficult for games that will incorporate CSAM to be available on the Indian internet\". The minister also spoke of the upcoming Digital India Act, that will be a contemporaneous legislation, to deal with everything necessary to ensure that the internet in India is safe and trusted for the digital 'nagriks'. \"India will chart its own course to ensure that the internet is safe and trusted, not just for adults but also for children,\" Chandrasekhar asserted.",
      "pubDate": "2023-03-04 01:35:00",
      "image_url": null,
      "source_id": "zeenews",
      "category": ["technology"],
      "country": ["india"],
      "language": "english"
    },
    {
      "title": "Breaking News Live Updates - 04 March 2023: Read All News, as it Happens, Only on News18.com",
      "link": "https://www.news18.com/news/breaking-news/today-breaking-news-live-updates-march-04-2023-7213939.html",
      "keywords": ["latest"],
      "creator": null,
      "video_url": null,
      "description": "News alerts from India, across the world, on coronavirus, politics, education, business, entertainment, lifestyle and sports. Follow all live updates here on News18.com.",
      "content": null,
      "pubDate": "2023-03-04 00:25:05",
      "image_url": "https://images.news18.com/ibnlive/uploads/2021/07/1627642197_news18_breaking_news-1200x800.jpg",
      "source_id": "news18",
      "category": ["top"],
      "country": ["india"],
      "language": "english"
    },
    {
      "title": "NJC reminds President of the separatist tactic: ‘little now more later’",
      "link": "http://island.lk/njc-reminds-president-of-the-separatist-tactic-little-now-more-later/",
      "keywords": ["News"],
      "creator": ["Thilina Walpola"],
      "video_url": null,
      "description": "The National Joint Committee (NJC), on Thursday, wrote to President Ranil Wickremesinghe cautioning him against the full implementation of the 13th Amendment to the Constitution.The letter, signed by Lt Col (Ret.) Anil Amarasekera, Co-President of NJC, said the full implementation of the 13th Amendment would amount to opening a Pandora’s Box. Given below are excerpts […]",
      "content": "The National Joint Committee (NJC), on Thursday, wrote to President Ranil Wickremesinghe cautioning him against the full implementation of the 13th Amendment to the Constitution.The letter, signed by Lt Col (Ret.) Anil Amarasekera, Co-President of NJC, said the full implementation of the 13th Amendment would amount to opening a Pandora’s Box. Given below are excerpts of the letter: “The Indo-Lanka accord, signed on 27th July, 1987, that was forced on Sri Lanka by India, through gunboat diplomacy, is illegal, according to articles 51 and 52 of the Vienna Convention on the law of Treaties. India also failed to implement some of the provisions therein, such as disarming the terrorists, and, as such, the Indo-Lanka Accord can be considered as repudiated. Therefore, do you consider the 13th Amendment, enacted on 14th November, 1987, in accordance with the Indo-Lanka Accord, to have any validity? “The English meaning of decentralization and devolution of power seem very similar when looked at superficially. However, the important fact that needs to be realized, when it comes to the governing power of a country, is that decentralization amounts to the transfer of that power, from the central government, to a local authorit, be it a region, a province or a district, while devolution is, on the other hand, the removal of central government power and handing that power over to a region, a province or a district. Therefore, decentralized power, if misused by a region, a province or a district, could be recalled by the central government, while devolved power cannot be recalled by the central government, if misused by a region, a province or a district. Taking into consideration the difficulty, or virtual impossibility, for a central government to recall devolved power to a region, a province, or a district, let us consider the possible repercussions of such an eventuality in this country, with several simple examples. “Firstly, let us consider irrigation, which is the life blood of the farming community in the northern and eastern provinces. Once this subject is devolved to a province, if the provincial administration fails to maintain the reservoirs (Wewas), and irrigation canals, in the Sinhala villages, there is nothing the central government can do to help the Sinhala cultivators in distress. The only alternative left for them would be to leave those villages, in the northern and eastern provinces, and migrate to some other province. “Secondly, let us consider the subject of health. Once this subject is devolved to a province, if the provincial administration fails to provide adequate funds to maintain the rural hospital buildings, serving the Sinhala community, or fails to provide adequate doctors, nurses and other staff, or even medical supplies, to rural hospitals in their area, the Sinhala villagers will have no other alternative left other than to leave the province and to migrate to some other province where these facilities are available. “Thirdly, let us consider the subject of education. Once this subject is devolved to a province, if the provincial administration fails to appoint the teachers needed to schools in Sinhala villages and also does not allocate adequate funds to maintain and repair school buildings in the Sinhala villages, there is nothing that the central government can do in this regard. The Sinhala population will therefore leave the province and migrate to some other province where good education facilities are available for their children. “These are only three simple examples that I have provided to bring to your attention the danger of devolving power to the provinces. However, the situation would be the same with regard to distribution of electricity, repair of roads, purchase of agricultural produce and many other such subjects, if there is devolution of power to a province, where the Sinhala population is a minority. Therefore, while devolution will only hasten the division of the country by creating administrative avenues to encourage the migration of the Sinhala population, from the northern and eastern provinces of the country, to other provinces, decentralization of power will not encourage such action as these powers can be withdrawn by the central government, if found to be misused by any provincial council. “C.V. Wigneswaran, MP, said recently that the full implementation of the 13th Amendment is good but that he will not look back until a federal constitution is promulgated. He is trying to apply Samuel James Veluppillai Chelvanayakam’s policy of ‘little now more later’ with an intention to first federate a unitary state, through the full implementation of the 13th Amendment. The federated state will subsequently be divided to establish Eelam, which is the final objective of the separatists. If Wigneswaran, and likeminded separatists, succeed to achieve during peace what they failed to achieve through three decades of war, all the sweat, blood, tears and toil expended by the security forces, sometimes even by sacrificing their very life and limb to defeat the separatists, would have been in vain. “This ‘little now later’ policy has been applied with great success by racist Tamil politicians since independence. They first succeeded in making Tamil, a language of the minority community, an official language, in par with Sinhala, which is the language of the majority community in this country. Tamil, incidentally, is not an official language, even in India, where the majority of the Tamil population live in this world. Through the enactment of the controversial 13th Amendment, the racist Tamil politicians succeeded in devolving much of political and administrative power to the northern and eastern provinces that can be utilised to create an exodus of the minority Sinhala population, from these two provinces, as pointed out previously in this letter. “Through the enactment of the 16th Amendment, these racist Tamil politicians succeeded in making Tamil the language of administration in the northern and eastern provinces, for the maintenance of public records and transactions of all business by public institutions. The majority Sinhala population, not being racists, had little or no objection while such discriminatory legislation was enacted for political expediency, but can the Sinhala majority continue to allow this ‘little now more later’ policy to continue? Therefore, in the interest of the Sinhala minority that is living in the northern and eastern provinces, the NJC kindly request you to promulgate a new Constitution for which the majority of the people in this country gave a mandate both at the last presidential and general elections so that the people living in any part of this country are not discriminated, based on their ethnic, caste or religious identity.” Published on By General Secretary of the Communist Party of Sri Lanka (CPSL), Dr. G. Weerasinghe said that the government must reveal whether it was CIA chief William J. Burns who visited Sri Lanka on 14 Feb.Dr. Weerasinghe said that a US delegation arrived in a special aircraft on 14 Feb, and their arrival and departure were closely guarded secrets. “Most of those who came in did not present passports and were not subjected to standard immigration procedure. In essence, there are no records of some people who came in,” he said. CPSL General Secretary said that many newspapers, of international repute, had reported that Burns was denied entry to Nepal, while coming from Sri Lanka, by the Kathmandu government. “Reporting on this move by Nepal, the says ‘it is learnt Burns returned home from Sri Lanka, the first leg of his South Asia trip after the Nepal government conveyed to the US Embassy in Kathmandu, that given the political developments, including the impending Presidential election, permission for the visit was being withheld.’ This was not reported here,” Dr. Weerasinghe said. The CPSL General Secretary said that the government must reveal whom the CIA Director met and what had been discussed. Dr. Weerasinghe said that Indian media had reported that Burns was to fly from Sri Lanka in a special C-17 Globemaster III along with several officials on 15 Feb., for an 18-hour stay in Kathmandu. Another two aircraft with some vehicles and “unspecified equipment,” meant for the US Embassy, had also been brought with the knowledge of the host government. Published on By The Monetary Board of the Central Bank of Sri Lanka (CBSL), at its meeting held on 03 March 2023, decided to raise the Standing Deposit Facility Rate (SDFR) and the Standing Lending Facility Rate (SLFR) of the Central Bank by 100 basis points to 15.50 percent and 16.50 percent, respectively, effective from the close of business, on 03 March 2023. The CBSL and the staff of the International Monetary Fund (IMF) have been engaging continuously in intensive negotiations on the monetary policy stance, amidst extraordinarily high inflation and a high degree of uncertainty surrounding inflation projections and the near term outlook. There have been some differences between the CBSL and IMF staff on the inflation outlook. Given the necessity of fulfilling all the ‘prior actions’ in order to move forward with the finalisation of the IMF Extended Fund Facility (EFF) arrangement, the Monetary Board and the IMF staff reached consensus to raise the policy interest rates, in a smaller magnitude, compared to the adjustment, which was envisaged during the initial stage of negotiations. This decision demonstrates Sri Lanka’s commitment to the IMF-EFF arrangement, which has been pursued by the Government in order to ensure stability in the economy, on multiple fronts. The finalisation of the IMF-EFF arrangement is expected to benefit all stakeholders and bolster confidence, which would help restore stability in the economy on a sustained basis. This will incentivise more foreign exchange flows in the period ahead that would aid the economy to overcome the prevailing economic crisis. The Board was of the view that the economy has already traversed through the most difficult and unprecedented times, with tremendous resilience, and strongly believes that today’s decision would pave way for a faster-than-expected deceleration of inflation. The Monetary Board anticipates that this monetary policy action would help lower the spread between policy interest rates and high market interest rates. This spread is expected to be further reduced with the reduction in market interest rates in the period ahead, especially the yields on government securities, reflecting the easing of risk premia as the debt restructuring process progresses. The Board urges all stakeholders to remain hopeful and reiterates its commitment to ensuring price and economic stability, and financial system stability, thereby assuring the normalisation of the interest rate structure, no sooner the price pressures are sufficiently contained in the period ahead Published on By The government has prevented the independent commissions from retaining independent lawyers, Rohana Hettiarachchi, Executive Director of People’s Action for Free and Fair Elections (PAFFREL) says.That would diminish these commissions’ ability to take any action that went against the desires of the governments, Hettiarachchi said. ” The Elections Commission is now represented by Saliya Peiris, PC. Now all commissions will have to depend on the Attorney General’s Department,” he said. “If the local council election is postponed by several months, it is likely that the government will try to change the electoral laws and postpone the polls further. Nominations that have already been submitted will become null and void in such an eventuality. The government has already appointed a delimitation commission and this can be used to delay elections, too. The Elections Commission only needs only Rs. 1.1 billion rupees for the election. The government really has no reason to say it has no money,” he said.",
      "pubDate": "2023-03-03 23:50:40",
      "image_url": null,
      "source_id": "island",
      "category": ["top"],
      "country": ["Sri Lanka"],
      "language": "english"
    },
    {
      "title": "Canada women agree interim funding deal in equal pay dispute",
      "link": "http://island.lk/canada-women-agree-interim-funding-deal-in-equal-pay-dispute/",
      "keywords": ["Sports"],
      "creator": ["Thilina Walpola"],
      "video_url": null,
      "description": "Canada Soccer has reached an interim funding agreement with its women’s national team players amid a dispute over equal pay.The deal reflects the men’s team’s terms with game-by-game incentives and results-based compensation. The women’s team had threatened to boycott a camp in April if demands over funding and pay inequality are not met.A final collective […]",
      "content": "Canada Soccer has reached an interim funding agreement with its women’s national team players amid a dispute over equal pay.The deal reflects the men’s team’s terms with game-by-game incentives and results-based compensation. The women’s team had threatened to boycott a camp in April if demands over funding and pay inequality are not met.A final collective bargaining deal with both the men’s and women’s sides remains under negotiation. “Canada Soccer has announced that a deal in principle has been reached with the Women’s National Team Players on an interim funding agreement for 2022,” the Canada Soccer Association (CSA) said in a statement on Thursday. The women’s team’s last agreement with CSA expired in 2021. In February, Canada’s women called off a planned strike because of the governing body’s threats of legal action, but they protested during the recent SheBelieves Cup by wearing purple T-shirts with the phrase “enough is enough” before their matches. “This is about respect, this is about dignity, and this is about equalising the competitive environment in a world that is fundamentally unequal,” Canada Soccer’s general secretary Earl Cochrane said. “We have been consistent and public about the need to have fairness and equal pay be pillars of any new agreements with our players, and we are delivering on that today.” Earlier this week, Canada Soccer president Nick Bontis announced his resignation, a decision welcomed by the Canadian Soccer Players’ Association (CSPA) and Canadian Men’s National Soccer Team Players’ Association (CMNSTPA) as “one necessary step” in ensuring the future success of the national teams.In a joint statement, the CSPA and CMNSTPA asked Canada Soccer for “transparent and comprehensive access” to financial records in light of recent funding cuts. They also want immediate action from the governing body to address the unauthorised use of player images, as well as financial restraints imposed by CSA’s agreement with Canada Business Soccer.Canada’s men went on strike in June 2022 after accusing CSA of “disrespect” over World Cup prize money and have said they “wholeheartedly support” the women’s side. The CSA spent $11m (£6.72m) on the men’s programme in 2021 and $5.1m (£3.11m) on the women’s programme.The women’s players said the “disgusting” discrepancy between the programmes became apparent at last year’s men’s World Cup. They are looking for the same backing for this year’s Women’s World Cup as the men received before Qatar, where they competed in the tournament for the first time in 37 years.Canada’s women, who are sixth in the world rankings and won Olympic gold in 2021, are in Group B for the World Cup, which takes place from 20 July to 20 August in Australia and New Zealand. Published on By Left-arm spinner Yuri Koththigoda excelled with a match bag of nine wickets as Richmond beat D.S. Senanayake College by an innings and 43 runs in the Under 19 traditional cricket encounter which ended before tea at Dombagoda on Friday. Koththigoda teamed up with Maheesha de Silva to rattle D.S. Senanayake for a meager total of 57 runs in the first innings. In their essay Richmond posted 233 runs with Janeth Kaushal top scoring with 61 runs. Batting for the second time DSS were bowled out for 133 runs. This time Koththigoda shared eight wickets with Sharon Abhishek to record their fifth outright victory of the season. At Reid Avenue, paceman Ranuka Malaviarachchi troubled Cambrians taking four early wickets. Royal restricted Prince of Wales to 136 runs before Dasis Manchanayake top scored with 91 runs for the home team to reach 185 for five wickets at stumps. Meanwhile, at Sooriyawewa, Maliyadewa topped 400 runs against Mahinda as Gayana Weerasinghe scored 149 runs inclusive of 17 fours and two sixes. In another traditional match, which ended in a draw, St. Anne’s took first innings honours against St. Joseph Vaz’s as Mahima Kotuwila scored a century to propel their total to 358 runs at Kurunegala. Richmond Maliyadeva top 400 runs at Sooriyawewa Maliyadeva 415 for 7 in 100 overs (Chamathkar Hettiarachchi 48, Pasindu Menaka 34, Chandupa Abeysinghe 38, Amesh Tennakoon 64, Gayana Weerasinghe 149, Jayamin Muthukumarana 38; Shehan Hasaranga 4/84) Published on By World number one Novak Djokovic continued his perfect start to 2023 by beating Hubert Hurkacz to reach the Dubai Tennis Championships semi-finals.The 35-year-old Serb took his record to 15-0 so far this year with a 6-3 7-5 win over Poland’s Hurkacz. Djokovic, who is chasing a sixth win in Dubai, was to face Daniil Medvedev for a place in Saturday’s final.Australian Open finalist Medvedev defeated Borna Coric 6-3 6-2 to stay on track for a third title this year. Meanwhile, defending champion Andrey Rublev beat Botic van de Zandschulp to progress.The second seed defeated his Dutch opponent 6-3 7-6 (7-3) and will play Alexander Zverev in the last four as the German overcame Lorenzo Sonego 7-5 6-4. Djokovic needed just 71 minutes to see off Hurkacz and is looking in fine form as he looks to win his third tournament of the year. “I found the rhythm on my serve throughout the second set,” he said. “I’m really glad with how I played under pressure.” Meanwhile, Djokovic is waiting for a response on his application for an exemption to visa rules on vaccines in order to enter the United States before the Masters 1000 event in Indian Wells, which begins on 8 March. The draw for that tournament takes place on Monday, and Djokovic said: “Whatever the decision is before the draw, if I’m not allowed I’m going to pull out, of course, before the draw.” Published on By India’s bid to defend 75 on the third day of the Indore Test started on the right note with R Ashwin striking off the second delivery of the day. After getting one to rip past Usman Khawaja’s outside edge in the first ball, he had him caught behind off the next ball with a similar delivery. Khawaja’s review went in vain, but that proved to be India’s lone moment of joy on the final day. While Travis Head and Marnus Labuschagne were kept on a tight leash for over ten overs by Ravindra Jadeja and Ashwin, the duo began to find a good measure of the spinners after settling in. Head began the charge by taking on Ashwin for a four and a six in the same over, which was backed up by Labuschagne’s loft off Jadeja as well. The sudden run flow put the spinners off, who had also got the ball changed at the tenth over mark. But even as Ashwin operated unchanged from one end, Australia began to press the accelerator. Head clobbered Umesh Yadav through the cover area for another boundary to get close to a fifty but before he could have a shot at it, Labuschagne finished the game off by lofting Ashwin over midwicket. The win gave Australia their first win of the series, and condemned India to their third home defeat in six years, two of which have come against a Steve Smith-led Australia. The victory also sealed Australia’s position in the World Test Championship final at the Oval in June this year. Australia ( )",
      "pubDate": "2023-03-03 23:40:53",
      "image_url": null,
      "source_id": "island",
      "category": ["sports"],
      "country": ["Sri Lanka"],
      "language": "english"
    },
    {
      "title": "Sri Lankan companies could reap multiple benefits by using INR in their biz with Indian counterparts – Indian H.C. Baglay",
      "link": "http://island.lk/sri-lankan-companies-could-reap-multiple-benefits-by-using-inr-in-their-biz-with-indian-counterparts-indian-h-c-baglay/",
      "keywords": ["Business"],
      "creator": ["Thilina Walpola"],
      "video_url": null,
      "description": "By Hiran H.Senewiratne There would be multiple benefits for Sri Lankan companies and entrepreneurs by adopting the arrangement of paying in Indian rupees (INR) in transactions they conduct with their Indian counterparts, India’s High Commissioner to Sri Lanka Gopal Baglay said. “This will also help towards growing bilateral trade between the two countries. This is […]",
      "content": "There would be multiple benefits for Sri Lankan companies and entrepreneurs by adopting the arrangement of paying in Indian rupees (INR) in transactions they conduct with their Indian counterparts, India’s High Commissioner to Sri Lanka Gopal Baglay said. “This will also help towards growing bilateral trade between the two countries. This is the right time to look into this aspect and this can also lead to more investments from India, the Indian High Commissioner said at a panel discussion on INR- denominated trade settlements between India and Sri Lanka. The event which was organized by the High Commission of India was held at Hotel Taj Samudra on Thursday. High Commissioner Baglay said that acceptance of INR in Sri Lanka will have a major advantage for tourism. “The fact that Indian tourists can pay in their own currency will make Sri Lanka a perfect destination for Indian tourists, he explained. H.C. Baglay added: “Another aspect Sri Lanka should look at is to move more towards digitalization. Today India accounts for over 40% of global digital transactions, which clearly shows the shift by our country towards digitalization.” Meanwhile, an Indian High Commission press release said: A team from RBI joined the discussion in the online format and indicated the possibility of settlement of current account transactions in goods as well as services in INR apart from the option of undertaking permitted capital account transactions. The RBI team referred to the close cooperation with CBSL and RBI’s commitment to further facilitate this process. State Minister of Finance Shehan Semasinghe appreciated the close economic relationship between the two countries and the financial and humanitarian support extended by India over the past year including the strong financing assurances provided by India in context of the IMF support programme for Sri Lanka. Governor, CBSL Dr. P. Nandalal Weerasinghe mentioned the strong desire among Indian and Sri Lankan business communities for enabling trade settlements in INR. He called for expanding this facility over a period of time to utilize it for the full range of capital and current account transactions. Governor CBSL also appreciated the wide-ranging participation from stakeholders in Sri Lanka and India which included more than 300 attendees in the physical format apart from those that joined online. Participants from Sri Lanka included officials from CBSL, Government of Sri Lanka, representatives from business and industry including tourism sector, media personnel, bank representatives, economists and journalists. Participants from India that connected in the online format included representatives from RBI, Government of India, trade and industry associations and export promotion councils. Published on By The People’s Convention for Good Governance was held at the BMICH in the midst of an exclusive audience, all of them invited and registered by the organizers, on February 25 .The Convener of this National Initiative Richard de Zoysa set the tone for the day by requesting the delegates to observe a minute’s silence for all those fought for the Independence of Ceylon ,the military personnel who sacrificed their lives to defend the country and to all those who contributed to serve their motherland. He added that the four forums that was to be the hub of the programme ,would speak on how we have reached this perilous predicament,what exactly is the situation we are at present and how we should work to overcome the challenges. Maithri Gunaratne P.C. former Governor of Central and Uva Province addressed the gathering on the post Independence period . Gunaratne spoke candidly on how nepotism started with D.S. Senanayake appointing his son Dudley to succeed him and the irreversible repercussion of S. W. R. D . Bandaranaike introducing the Sinhala only act to capture power. “The JVP insurrection and the LTTE terrorism was also largely due to this selfish motive”. He went on to say that large scale corruption started in 1977 during the J R Jayawardena Government where an open market economy was formulated. The present situation where the Constitution does not always enforce the will of the people was also crafted during his tenure. Gunaratne summed up by stating that the Rajapaksa Government though ending the separatist war, failed to reconcile the country and plunged it into bankruptcy, together with the governments that followed. Omar Khan a US national of Pakistani heritage, having come to Sri Lanka in 1993 and a well known motivational speaker headlined his address a ‘Visionary Catalyst’ , and spoke of the importance of following up on decisions made, if a country is to progress. Murtaza Jaferjee the Chairman of the Advocata Institute delivered a flawless speech on Economic Recovery with a presentation of facts that had the audience captivated. Prof. Arjuna Parakrama moderated the Education Reforms panel that included Dr.Tara de Mel , Prof. Harendra de Silva and Nile Anandappa. Shehara Parakrama and Sharhan Muhseen a top rung investment banker and an expert in mergers and acquisitions exchanged thoughts on the Production and Services forum. Dr. Pakiasothy Saravanamuttu moderated an interesting panel on Ethnicity which included Selvi Sachithanandam , Ishan Jalill , Jeremy Liyanage , & Arun Siddarth who had a thought provoking discussion on the minorities. Arun Siddarth was candid about the caste problem that is still preventing him entering certain facilities that are reserved for the upper caste Tamils. He also declared that it was the politicians who created the rift between the Sinhalese and the Tamils. An interesting Q & A followed, which gave much food for thought.The Guest of Honour Dr .Walter Jayasinghe who lives in California, and does an enormous amount of social work for the underprivileged, declared open the Empowering Lanka website that will be a fully transparent fund raising platform with the inflow and outflow clearly visible. Primarily to help alleviate poverty and develop districts that lack basic infrastructure needs, the first Directors Dr./ Ms Walter Jayasinghe and Richard de Zoysa will source funds from both international and local donors. The funds raised will be disbursed to those who conform to a predetermined criteria laid down by the Board of Directors of the company limited by guarantee. Once commissioned officially, funds will be used to develop District by District monthly as planned by Dr. Sarath Seneviratne who mooted this concept 15 years ago. The entire convention can be viewed by going into Arise Sri Lanka YouTube channel -@arisesrilanka or Facebook – @Arise Sri Lanka Published on By Seylan Bank reported a robust Profit before Tax (PBT) of LKR 6.6 Bn, a 10% growth for the year ended 31st December 2022 while recording a Profit after Tax (PAT) of LKR 4.7 Bn delivering a stable performance. The results were further buoyed by an impressive 72% rise in Net Interest Income (NII) for the year under review, compared to 21% in the previous year, Mindful of the current uncertainties, the Bank reinforces its resilience and stability with continued profitability trend in 2022, while supporting the nation’s economic resurgence. Seylan Bank’s NII was fueled by surges in both Interest Income and Interest Expenses reflecting a growth of 84% and 96% respectively in 2022, compared to a de-growth of 8% and 27% the previous year. The rise in the NII was mainly driven by increase in market rates, and faster repricing of loan book than the deposit base. The Net Interest Margin stood at 6.33% in 2022 compared to 4.05% recorded in 2021. In a year which was challenged by many commuting issues, the Bank continued to leverage innovation and technology to play a pioneering role in digital payment and adoption of bespoke solutions. FY 2022 witnessed a growth of over 70% in the eCommerce market space, fueled by the Seylan Merchant Portal achieving a significant growth in turnover. Digital engagement has also increased with e-statement penetration on Current Accounts rising to 44% and credit cards to 79% during 2022 and this initiative further supported the Bank’s positive continuation towards minimizing its carbon foot print. Furthermore, Seylan Bank uplifted the Mobile Banking App to provide great convenience with access via biometrics and face detection technology. Seylan Bank has also set up 96 Cheque Deposit Machines across the island enabling access to many current account holders with 24×7 access. Published on By Sampath Bank has officially unveiled ‘Value Added Agriculture’ Programme in collaboration with CIC Holdings PLC with the aim of strengthening agri-entrepreneurs in different parts of the country by promoting value added agriculture among rural communities. This programme will take place in the areas where the Bank’s flagship, award-winning “Wewata Jeewayak” tank restoration programme has been implemented so far. The ‘Value Added Agriculture’ Programme was officially launched with the first event being conducted on 23rd January 2023 with the participation of members of Divulankadawala Farmers Associations in Medirigiriya where the Bank successfully completed the tank restoration programme in 2018. During the event, a panel of experts from CIC Holdings conducted the knowledge sharing sessions on Value Added Agriculture for the members of the Farmers Association. A financial literacy programme was conducted by Sampath Bank at the event in order to develop the agri-entrepreneurs’ financial management skills. ‘Value Added Agriculture’ generally refers to processes that boost the value of primary agricultural commodities. This increases the economic value of the commodity as the customer base of a product and revenue sources for the producer are expanded. With the know-how on new agri-based technologies and ‘value added agriculture’ the rural agricultural community will benefit significantly and will be well-positioned to produce farm products with a higher intrinsic value. The proposed programme aligns with the culture, competencies and value systems of both Sampath Bank and CIC Holdings. Both organisations are well-known to possess a deep-rooted understanding of the pulse of the rural communities. The promotion of climate smart agriculture, modern water management techniques and grooming agri-entrepreneurs are ancillary objectives of the programme. Sampath Bank’s Chief Human Resource Officer Dr. Lalith Weragoda stated, “To enhance our food security and be better equipped to face the current economic crisis, Sri Lanka needs to take bold steps to increase agricultural output. We need both high yields and high-quality yields, both of which will be possible through this Value added Agriculture programme. Amidst this process, Sampath Bank plays a significant role by developing a strategic link/synergy to diverse industries. The programme, which combines the inherent strengths of Sampath Bank and CIC Holdings, will go a long way in empowering these agri-entrepreneurs and get them to deploy these agri-based technologies to increase their harvest and their income, leading to a better quality of life for those communities.” Sampath Bank initiated the “Wewata Jeewayak” tank restoration programme in the year 2001 to restore traditional irrigation network of neglected tanks located in the Dry Zone in Sri Lanka. Thousands of farming families have been benefited directly and indirectly through this initiative in many ways in the past two decades. The main objective is to ensure a dependable year-round supply of water to cultivate the paddy land and harvest both cropping seasons, safeguarding the sustainable livelihoods of small-scale agrarian entrepreneurs as a result. Inculcating the value system of working together for common benefit of the community, empowering communities, youth leadership, and women empowerment are other objectives of this programme. Over the years, Sampath Bank has won numerous accolades and gained recognition for its wide-ranging contribution to environmental, social and economic sustainability. In addition to ‘Wewata Jeewayak’, the Bank has also several other CSR initiatives including, ‘Sayurata Husmak’, ‘Gasai Mamai, Pubudu Pothai’, among others. Sampath Bank is a 100% local bank that has deeply rooted itself in the lives of the people of Sri Lanka. Established in 1987, the bank has become a state-of-the-art financial institution that continues to be a market leader today thanks to its constant innovation and customer focused approach to business. It has introduced many firsts to the Sri Lankan banking sector including introducing ATMs to Sri Lanka, extended banking hours, slip-less banking and adaptation of block-chain technology to name a few. As part of its visionary 2022 approach, the bank is steadily transforming itself into a ‘tech company engaged in banking,’ from the traditional approach of a bank adopting technology.",
      "pubDate": "2023-03-03 23:40:20",
      "image_url": null,
      "source_id": "island",
      "category": ["business"],
      "country": ["Sri Lanka"],
      "language": "english"
    },
    {
      "title": "Djokovic beats Hurkacz to reach semi-finals in Dubai",
      "link": "http://island.lk/djokovic-beats-hurkacz-to-reach-semi-finals-in-dubai/",
      "keywords": ["Sports"],
      "creator": ["Thilina Walpola"],
      "video_url": null,
      "description": "World number one Novak Djokovic continued his perfect start to 2023 by beating Hubert Hurkacz to reach the Dubai Tennis Championships semi-finals.The 35-year-old Serb took his record to 15-0 so far this year with a 6-3 7-5 win over Poland’s Hurkacz. Djokovic, who is chasing a sixth win in Dubai, was to face Daniil Medvedev […]",
      "content": "World number one Novak Djokovic continued his perfect start to 2023 by beating Hubert Hurkacz to reach the Dubai Tennis Championships semi-finals.The 35-year-old Serb took his record to 15-0 so far this year with a 6-3 7-5 win over Poland’s Hurkacz. Djokovic, who is chasing a sixth win in Dubai, was to face Daniil Medvedev for a place in Saturday’s final.Australian Open finalist Medvedev defeated Borna Coric 6-3 6-2 to stay on track for a third title this year. Meanwhile, defending champion Andrey Rublev beat Botic van de Zandschulp to progress.The second seed defeated his Dutch opponent 6-3 7-6 (7-3) and will play Alexander Zverev in the last four as the German overcame Lorenzo Sonego 7-5 6-4. Djokovic needed just 71 minutes to see off Hurkacz and is looking in fine form as he looks to win his third tournament of the year. “I found the rhythm on my serve throughout the second set,” he said. “I’m really glad with how I played under pressure.” Meanwhile, Djokovic is waiting for a response on his application for an exemption to visa rules on vaccines in order to enter the United States before the Masters 1000 event in Indian Wells, which begins on 8 March. The draw for that tournament takes place on Monday, and Djokovic said: “Whatever the decision is before the draw, if I’m not allowed I’m going to pull out, of course, before the draw.” Published on By Canada Soccer has reached an interim funding agreement with its women’s national team players amid a dispute over equal pay.The deal reflects the men’s team’s terms with game-by-game incentives and results-based compensation. The women’s team had threatened to boycott a camp in April if demands over funding and pay inequality are not met.A final collective bargaining deal with both the men’s and women’s sides remains under negotiation. “Canada Soccer has announced that a deal in principle has been reached with the Women’s National Team Players on an interim funding agreement for 2022,” the Canada Soccer Association (CSA) said in a statement on Thursday. The women’s team’s last agreement with CSA expired in 2021. In February, Canada’s women called off a planned strike because of the governing body’s threats of legal action, but they protested during the recent SheBelieves Cup by wearing purple T-shirts with the phrase “enough is enough” before their matches. “This is about respect, this is about dignity, and this is about equalising the competitive environment in a world that is fundamentally unequal,” Canada Soccer’s general secretary Earl Cochrane said. “We have been consistent and public about the need to have fairness and equal pay be pillars of any new agreements with our players, and we are delivering on that today.” Earlier this week, Canada Soccer president Nick Bontis announced his resignation, a decision welcomed by the Canadian Soccer Players’ Association (CSPA) and Canadian Men’s National Soccer Team Players’ Association (CMNSTPA) as “one necessary step” in ensuring the future success of the national teams.In a joint statement, the CSPA and CMNSTPA asked Canada Soccer for “transparent and comprehensive access” to financial records in light of recent funding cuts. They also want immediate action from the governing body to address the unauthorised use of player images, as well as financial restraints imposed by CSA’s agreement with Canada Business Soccer.Canada’s men went on strike in June 2022 after accusing CSA of “disrespect” over World Cup prize money and have said they “wholeheartedly support” the women’s side. The CSA spent $11m (£6.72m) on the men’s programme in 2021 and $5.1m (£3.11m) on the women’s programme.The women’s players said the “disgusting” discrepancy between the programmes became apparent at last year’s men’s World Cup. They are looking for the same backing for this year’s Women’s World Cup as the men received before Qatar, where they competed in the tournament for the first time in 37 years.Canada’s women, who are sixth in the world rankings and won Olympic gold in 2021, are in Group B for the World Cup, which takes place from 20 July to 20 August in Australia and New Zealand. Published on By Left-arm spinner Yuri Koththigoda excelled with a match bag of nine wickets as Richmond beat D.S. Senanayake College by an innings and 43 runs in the Under 19 traditional cricket encounter which ended before tea at Dombagoda on Friday. Koththigoda teamed up with Maheesha de Silva to rattle D.S. Senanayake for a meager total of 57 runs in the first innings. In their essay Richmond posted 233 runs with Janeth Kaushal top scoring with 61 runs. Batting for the second time DSS were bowled out for 133 runs. This time Koththigoda shared eight wickets with Sharon Abhishek to record their fifth outright victory of the season. At Reid Avenue, paceman Ranuka Malaviarachchi troubled Cambrians taking four early wickets. Royal restricted Prince of Wales to 136 runs before Dasis Manchanayake top scored with 91 runs for the home team to reach 185 for five wickets at stumps. Meanwhile, at Sooriyawewa, Maliyadewa topped 400 runs against Mahinda as Gayana Weerasinghe scored 149 runs inclusive of 17 fours and two sixes. In another traditional match, which ended in a draw, St. Anne’s took first innings honours against St. Joseph Vaz’s as Mahima Kotuwila scored a century to propel their total to 358 runs at Kurunegala. Richmond Maliyadeva top 400 runs at Sooriyawewa Maliyadeva 415 for 7 in 100 overs (Chamathkar Hettiarachchi 48, Pasindu Menaka 34, Chandupa Abeysinghe 38, Amesh Tennakoon 64, Gayana Weerasinghe 149, Jayamin Muthukumarana 38; Shehan Hasaranga 4/84) Published on By India’s bid to defend 75 on the third day of the Indore Test started on the right note with R Ashwin striking off the second delivery of the day. After getting one to rip past Usman Khawaja’s outside edge in the first ball, he had him caught behind off the next ball with a similar delivery. Khawaja’s review went in vain, but that proved to be India’s lone moment of joy on the final day. While Travis Head and Marnus Labuschagne were kept on a tight leash for over ten overs by Ravindra Jadeja and Ashwin, the duo began to find a good measure of the spinners after settling in. Head began the charge by taking on Ashwin for a four and a six in the same over, which was backed up by Labuschagne’s loft off Jadeja as well. The sudden run flow put the spinners off, who had also got the ball changed at the tenth over mark. But even as Ashwin operated unchanged from one end, Australia began to press the accelerator. Head clobbered Umesh Yadav through the cover area for another boundary to get close to a fifty but before he could have a shot at it, Labuschagne finished the game off by lofting Ashwin over midwicket. The win gave Australia their first win of the series, and condemned India to their third home defeat in six years, two of which have come against a Steve Smith-led Australia. The victory also sealed Australia’s position in the World Test Championship final at the Oval in June this year. Australia ( )",
      "pubDate": "2023-03-03 23:40:08",
      "image_url": null,
      "source_id": "island",
      "category": ["sports"],
      "country": ["Sri Lanka"],
      "language": "english"
    },
    {
      "title": "Head leads last leg of Australia’s victory march",
      "link": "http://island.lk/head-leads-last-leg-of-australias-victory-march-2/",
      "keywords": ["Sports"],
      "creator": ["Thilina Walpola"],
      "video_url": null,
      "description": "India’s bid to defend 75 on the third day of the Indore Test started on the right note with R Ashwin striking off the second delivery of the day. After getting one to rip past Usman Khawaja’s outside edge in the first ball, he had him caught behind off the next ball with a similar […]",
      "content": "India’s bid to defend 75 on the third day of the Indore Test started on the right note with R Ashwin striking off the second delivery of the day. After getting one to rip past Usman Khawaja’s outside edge in the first ball, he had him caught behind off the next ball with a similar delivery. Khawaja’s review went in vain, but that proved to be India’s lone moment of joy on the final day. While Travis Head and Marnus Labuschagne were kept on a tight leash for over ten overs by Ravindra Jadeja and Ashwin, the duo began to find a good measure of the spinners after settling in. Head began the charge by taking on Ashwin for a four and a six in the same over, which was backed up by Labuschagne’s loft off Jadeja as well. The sudden run flow put the spinners off, who had also got the ball changed at the tenth over mark. But even as Ashwin operated unchanged from one end, Australia began to press the accelerator. Head clobbered Umesh Yadav through the cover area for another boundary to get close to a fifty but before he could have a shot at it, Labuschagne finished the game off by lofting Ashwin over midwicket. The win gave Australia their first win of the series, and condemned India to their third home defeat in six years, two of which have come against a Steve Smith-led Australia. The victory also sealed Australia’s position in the World Test Championship final at the Oval in June this year. Australia ( ) Published on By Canada Soccer has reached an interim funding agreement with its women’s national team players amid a dispute over equal pay.The deal reflects the men’s team’s terms with game-by-game incentives and results-based compensation. The women’s team had threatened to boycott a camp in April if demands over funding and pay inequality are not met.A final collective bargaining deal with both the men’s and women’s sides remains under negotiation. “Canada Soccer has announced that a deal in principle has been reached with the Women’s National Team Players on an interim funding agreement for 2022,” the Canada Soccer Association (CSA) said in a statement on Thursday. The women’s team’s last agreement with CSA expired in 2021. In February, Canada’s women called off a planned strike because of the governing body’s threats of legal action, but they protested during the recent SheBelieves Cup by wearing purple T-shirts with the phrase “enough is enough” before their matches. “This is about respect, this is about dignity, and this is about equalising the competitive environment in a world that is fundamentally unequal,” Canada Soccer’s general secretary Earl Cochrane said. “We have been consistent and public about the need to have fairness and equal pay be pillars of any new agreements with our players, and we are delivering on that today.” Earlier this week, Canada Soccer president Nick Bontis announced his resignation, a decision welcomed by the Canadian Soccer Players’ Association (CSPA) and Canadian Men’s National Soccer Team Players’ Association (CMNSTPA) as “one necessary step” in ensuring the future success of the national teams.In a joint statement, the CSPA and CMNSTPA asked Canada Soccer for “transparent and comprehensive access” to financial records in light of recent funding cuts. They also want immediate action from the governing body to address the unauthorised use of player images, as well as financial restraints imposed by CSA’s agreement with Canada Business Soccer.Canada’s men went on strike in June 2022 after accusing CSA of “disrespect” over World Cup prize money and have said they “wholeheartedly support” the women’s side. The CSA spent $11m (£6.72m) on the men’s programme in 2021 and $5.1m (£3.11m) on the women’s programme.The women’s players said the “disgusting” discrepancy between the programmes became apparent at last year’s men’s World Cup. They are looking for the same backing for this year’s Women’s World Cup as the men received before Qatar, where they competed in the tournament for the first time in 37 years.Canada’s women, who are sixth in the world rankings and won Olympic gold in 2021, are in Group B for the World Cup, which takes place from 20 July to 20 August in Australia and New Zealand. Published on By Left-arm spinner Yuri Koththigoda excelled with a match bag of nine wickets as Richmond beat D.S. Senanayake College by an innings and 43 runs in the Under 19 traditional cricket encounter which ended before tea at Dombagoda on Friday. Koththigoda teamed up with Maheesha de Silva to rattle D.S. Senanayake for a meager total of 57 runs in the first innings. In their essay Richmond posted 233 runs with Janeth Kaushal top scoring with 61 runs. Batting for the second time DSS were bowled out for 133 runs. This time Koththigoda shared eight wickets with Sharon Abhishek to record their fifth outright victory of the season. At Reid Avenue, paceman Ranuka Malaviarachchi troubled Cambrians taking four early wickets. Royal restricted Prince of Wales to 136 runs before Dasis Manchanayake top scored with 91 runs for the home team to reach 185 for five wickets at stumps. Meanwhile, at Sooriyawewa, Maliyadewa topped 400 runs against Mahinda as Gayana Weerasinghe scored 149 runs inclusive of 17 fours and two sixes. In another traditional match, which ended in a draw, St. Anne’s took first innings honours against St. Joseph Vaz’s as Mahima Kotuwila scored a century to propel their total to 358 runs at Kurunegala. Richmond Maliyadeva top 400 runs at Sooriyawewa Maliyadeva 415 for 7 in 100 overs (Chamathkar Hettiarachchi 48, Pasindu Menaka 34, Chandupa Abeysinghe 38, Amesh Tennakoon 64, Gayana Weerasinghe 149, Jayamin Muthukumarana 38; Shehan Hasaranga 4/84) Published on By World number one Novak Djokovic continued his perfect start to 2023 by beating Hubert Hurkacz to reach the Dubai Tennis Championships semi-finals.The 35-year-old Serb took his record to 15-0 so far this year with a 6-3 7-5 win over Poland’s Hurkacz. Djokovic, who is chasing a sixth win in Dubai, was to face Daniil Medvedev for a place in Saturday’s final.Australian Open finalist Medvedev defeated Borna Coric 6-3 6-2 to stay on track for a third title this year. Meanwhile, defending champion Andrey Rublev beat Botic van de Zandschulp to progress.The second seed defeated his Dutch opponent 6-3 7-6 (7-3) and will play Alexander Zverev in the last four as the German overcame Lorenzo Sonego 7-5 6-4. Djokovic needed just 71 minutes to see off Hurkacz and is looking in fine form as he looks to win his third tournament of the year. “I found the rhythm on my serve throughout the second set,” he said. “I’m really glad with how I played under pressure.” Meanwhile, Djokovic is waiting for a response on his application for an exemption to visa rules on vaccines in order to enter the United States before the Masters 1000 event in Indian Wells, which begins on 8 March. The draw for that tournament takes place on Monday, and Djokovic said: “Whatever the decision is before the draw, if I’m not allowed I’m going to pull out, of course, before the draw.”",
      "pubDate": "2023-03-03 23:40:05",
      "image_url": null,
      "source_id": "island",
      "category": ["sports"],
      "country": ["Sri Lanka"],
      "language": "english"
    },
    {
      "title": "eXp Realty Paid Over $240 Million in Revenue Share and Equity Benefits to Agents and Brokers in 2022",
      "link": "https://www.finanzen.ch/nachrichten/aktien/exp-realty-paid-over-$240-million-in-revenue-share-and-equity-benefits-to-agents-and-brokers-in-2022-1032144988",
      "keywords": null,
      "creator": null,
      "video_url": null,
      "description": "<p align=\"center\"><em>Aligning the interests of agents and brokers with the company they own is key to eXp Realty’s long-term growth strategy</em><!-- sh_cad_1 --> <p align=\"left\"><em><img alt=\"REVEQSHARE-PR1200x630bl1 (1)\" data-mce-style=\"display: block; margin-left: auto; margin-right: auto;\" height=\"315\" name=\"GNW_RichHtml_External_IMG\"...",
      "content": "Aligning the interests of agents and brokers with the company they own is key to eXp Realty’s long-term growth strategy BELLINGHAM, Wash., March 03, 2023 (GLOBE NEWSWIRE) -- eXp Realty ® , \"the most agent-centric real estate brokerage on the planet™” and the core subsidiary of eXp World Holdings, Inc. (Nasdaq: EXPI), today released its 2022 revenue share and agent equity payout figures, demonstrating how its competitive compensation model underpins continued agent growth. Revenue Share and Equity Paid to Agents and Brokers Continues To Increase Year-over-Year \"When eXp Realty was founded, we set out to build the most agent-centric brokerage that solved the biggest pain point in real estate for agents,” said Glenn Sanford, Founder and CEO of eXp Realty. \"Historically, agents were generally not offered meaningful ownership in the brokerages they were part of and the profit/revenue sharing models didn’t provide a viable path to potential retirement for the vast majority of agents. \"With this in mind, an important part of building eXp was designing a truly aligned compensation model that rewards agents for their production and contribution to the company’s growth. As we have disclosed in our fourth quarter and full-year 2022 results, our model and core business has proven to be sustainable in both good and bad markets. More importantly, it proves that we are delivering on the promise we made to agents when eXp was founded in 2009. By building the most agent-centric real estate brokerage on the planet, we continue to grow, improving the lives of agents around the world. All that being said, since becoming a public company in 2013, EXPI’s stock has outperformed all other publicly traded real estate brokerages, franchisors and brokerage/franchisor conglomerates. We also enjoy the highest market cap among all publicly traded residential real estate brokerage platforms, showing once again that focusing on the agent experience isn’t just good for the agent, but it has also been good for long-term shareholders.” About eXp World Holdings, Inc. eXp World Holdings, Inc. (Nasdaq: EXPI) is the holding company for eXp Realty ® , Virbela and SUCCESS ® Enterprises. eXp Realty is the largest independent real estate company in the world with more than 87,000 agents in the United States, Canada, the United Kingdom, Australia, South Africa, India, Mexico, Portugal, France, Puerto Rico, Brazil, Italy, Hong Kong, Colombia, Spain, Israel, Panama, Germany, Dominican Republic, Greece, New Zealand, Chile, Poland and Dubai and continues to scale internationally. As a publicly traded company, eXp World Holdings provides real estate professionals the unique opportunity to earn equity awards for production goals and contributions to overall company growth. eXp World Holdings and its businesses offer a full suite of brokerage and real estate tech solutions, including its innovative residential and commercial brokerage model, professional services, collaborative tools and personal development. The cloud-based brokerage is powered by Virbela, an immersive 3D platform that is deeply social and collaborative, enabling agents to be more connected and productive. SUCCESS ® Enterprises, anchored by SUCCESS ® magazine and its related media properties, was established in 1897 and is a leading personal and professional development brand and publication. For more information, visit https://expworldholdings.com . Safe Harbor Statement The statements contained herein may include statements of future expectations and other forward-looking statements that are based on management’s current views and assumptions and involve known and unknown risks and uncertainties that could cause actual results, performance or events to differ materially from those expressed or implied in such statements. Such forward-looking statements speak only as of the date hereof, and the company undertakes no obligation to revise or update them. These statements include, but are not limited to, statements about the continued growth of our agent and broker base and expansion of our residential real estate brokerage business into foreign markets. Such statements are not guarantees of future performance. Important factors that may cause actual results to differ materially and adversely from those expressed in forward-looking statements include changes in business or other market conditions; the difficulty of keeping expense growth at modest levels while increasing revenues; and other risks detailed from time to time in the company’s Securities and Exchange Commission filings, including but not limited to the most recently filed Quarterly Report on Form 10-Q and Annual Report on Form 10-K. Media Relations Contact: Jennifer Zimmerman eXp World Holdings, Inc. mediarelations@expworldholdings.com Investor Relations Contact: Denise Garcia, Managing Partner Hayflower Partners investors@expworldholdings.com Photos accompanying this announcement are available at https://www.globenewswire.com/NewsRoom/AttachmentNg/e0d795ac-5bdd-4f9c-af3d-3f470035652e https://www.globenewswire.com/NewsRoom/AttachmentNg/15708f42-8fb1-46df-b714-aebb17bf171a INFLATION: WELTWEIT STEIGEN DIE PREISE Nachrichten zu eXp Realty International Corp Analysen zu eXp Realty International Corp Aktien Top/Flop Inside Trading & Investment Inside Fonds Aktien in diesem Artikel Meistgelesene Nachrichten Börse aktuell - Live Ticker Der heimische sowie der deutsche Aktienmarkt zeigten sich am Freitag mit grünen Vorzeichen. Zum Wochenausklang entwickelten sich die US-Börsen freundlich. An den Märkten in Fernost präsentierten sich die Anleger am Freitag mehrheitlich in Kauflaune. finanzen.net News Nachrichten",
      "pubDate": "2023-03-03 22:39:26",
      "image_url": null,
      "source_id": "finanzen_ch",
      "category": ["top"],
      "country": ["switzerland"],
      "language": "german"
    }
  ],
  "nextPage": "16778831664cd72ee8d0eef283632fc1fb3a6da1a0"
}
